package ru.geekbrains.level_1.lesson_1;

//1) Создать пустой проект в IntelliJ IDEA и прописать метод main().
//2) Создать переменные всех пройденных типов данных и инициализировать их значения.
//3) Написать метод вычисляющий выражение a * (b + (c / d)) и возвращающий результат,
//   где a, b, c, d – аргументы этого метода, имеющие тип float.
//4) Написать метод, принимающий на вход два целых числа и проверяющий, что их сумма лежит в пределах от 10 до 20
//   (включительно), если да – вернуть true, в противном случае – false.
//5) Написать метод, которому в качестве параметра передается целое число, метод должен напечатать в консоль,
//   положительное ли число передали или отрицательное. Замечание: ноль считаем положительным числом.
//6) Написать метод, которому в качестве параметра передается целое число. Метод должен вернуть true, если число
//   отрицательное, и вернуть false если положительное.
//7) Написать метод, которому в качестве параметра передается строка, обозначающая имя. Метод должен вывести в консоль
//   сообщение «Привет, указанное_имя!».
//8) *Написать метод, который определяет, является ли год високосным, и выводит сообщение в консоль. Каждый 4-й год
//   является високосным, кроме каждого 100-го, при этом каждый 400-й – високосный.

public class Lesson_1 {

    public static void main(String[] args) {

        byte b = -120;
        short s = 12442;
        int i = 1000;
        long l = 200000L;
        float f = 12.23f;
        double d = -123.123;
        char c = '*';
        boolean bl = false;

        System.out.println("Задание 3: " + task_3(1, 2, 3, 4));
        System.out.println("Задание 4: " + task_4(1, 7));
        task_5(-1);
        System.out.println("Задание 6: " + task_6(-1));
        task_7("Роман");
        task_8(4);
    }

    public static float task_3(float a, float b, float c, float d) {
        return a * (b + (c / d));
    }

    public static boolean task_4(int a, int b) {
        boolean bl = ((a + b) >= 10) && ((a + b) <= 20);
        return bl;
    }

    public static void task_5(int a) {
        if (a >= 0) {
            System.out.println("Задание 5: Это число положительное!");
        } else {
            System.out.println("Задание 5: Это число отрицательное!");
        }
    }

    public static boolean task_6(int a) {
        return a < 0;
    }

    public static void task_7(String name) {
        System.out.println("Задание 7: Привет, " + name + "!");
    }

    public static void task_8(int year) {
        if ((year % 4 == 0 && year % 100 != 0) || year % 400 == 0) {
            System.out.println("Задание 8: Год является високосным!");
        } else {
            System.out.println("Задание 8: Год не является високосным!");
        }
    }
}
